/*-----------------------------------------------------
УПРАВЛЕНИЕ ДОСТУПОМ
-----------------------------------------------------*/
//---------------------------------------------------6-1
class A {
protected:
   int a1;
public:
   int a2;
   void f();
};

class B : public A {
   int b;
public:
   void g();
};
class C : B {
public:
   void h();
};

//--------------------------------- выражение a
void main(){ B x; x.b++; }
//--------------------------------- выражение b
void B::g(){ a1++; }
//--------------------------------- выражение с
void B::g(){ a2++; }
//--------------------------------- выражение d
void C::h(){ a1++; }
//--------------------------------- выражение e
void C::h(){ a2++; }

//---------------------------------------------------6-2
class A {
   void f();
protected:
   int a1;
public:
   int a2;
};

class B : public A {
public:
   int b;
   void g();
};

class C : public B {
public:
   void h();
};


//--------------------------------- выражение a
void main(){ B x; x.a2++; }
//--------------------------------- выражение b
void main(){ C x; x.a2++; }
//--------------------------------- выражение с
void main(){ B x; x.a1++; }
//--------------------------------- выражение d
void main(){ C x; x.a1++; }
//--------------------------------- выражение e
void main(){ C x; x.b++; }

//---------------------------------------------------6-3
class A {
   void f1();
protected:
   void f2();
public:
   void f3();
};

class B : public A {
public:
   void g();
};

class C : public B {
public:
   void h();
};

//--------------------------------- выражение a
void A::f2(){ f1(); }
//--------------------------------- выражение b
void B::g(){ f1(); }
//--------------------------------- выражение с
void B::g(){ f2(); }
//--------------------------------- выражение d
void C::h(){ f1(); }
//--------------------------------- выражение e
void C::h(){ f2(); }

//---------------------------------------------------6-4
class A {
   void f1();
protected:
   void f2();
public:
   void f3();
};

class B :  A {
public:
   void g();
};

class C :  B {
public:
   void h();
};

//--------------------------------- выражение a
void B::g(){ f2(); }
//--------------------------------- выражение b
void C::h(){ f2(); }
//--------------------------------- выражение с
void B::g(){ f3(); }
//--------------------------------- выражение d
void C::h(){ f3(); }
//--------------------------------- выражение e
void C::h(){ B::g(); }

//---------------------------------------------------6-5
class A {
   int a1;
protected:
   int a2;
public:
   int a3;
};

class B :  public A {
protected:
   int b;
public:
   void g();
};

class C :  B {
public:
   void h();
};

//--------------------------------- выражение a
void B::g(){ a2++; }
//--------------------------------- выражение b
void C::h(){ a1++; }
//--------------------------------- выражение с
void C::h(){ a2++; }
//--------------------------------- выражение d
void C::h(){ a3++; }
//--------------------------------- выражение e
void C::h(){ b++; }

