//------------------------------------------------------44-11.cpp
//----- Ввод десятичного вещественного целого числа
 double StringToFloat(char c[]){
 int i;
 double n,v;
 for (i=0; !(c[i]>='0' && c[i]<='9'); i++)
	  if (c[i]=='\0') return 0;				// Поиск первой цифры
 for (n=0; c[i]>='0' && c[i]<='9'; i++)     // Накопление целого
 n = n * 10 + c[i] - '0';                   // "цифра за цифрой"
 if (c[i]!='.') return n;
 for (i++, v=0.1; c[i]>='0' && c[i]<='9';i++){
	n+=v*(c[i] - '0');						// Взвешивание цифр	
	v=v/10;									// весом разряда дробной части
	}
 return n; }

  #include <stdio.h>
 void main(){
 printf("v=%lf\n",StringToFloat("12546.64576"));
 }
