//-------------------------------------------------91-15.cpp
//------------------------------------------------ 1
int F1(){
int i; long l;
for (l=1,i=0; l >0;  l<<=1, i++);
return i;}
//------------------------------------------------ 2
int F2(){
int i; long l;
for (l=1,i=0; l !=0; l<<=1, i++);
return i;}
//------------------------------------------------ 3
int F3(long n)
{ int i,s;
for (i=0,s=0; i < sizeof(long) * 8; i++, n >>=1)
	if (n & 0x7==5) { s++; i+=2; }
return s; }
//------------------------------------------------ 4
long F4(long n)
{ int i; long s;
for (i=s=0; i < sizeof(long) * 8; i++)
	{ s <<=1; s |= n & 1; n >>=1; }
return s; }
//------------------------------------------------ 5
long F5(long n, int m1, int m2)
{ long s,x; int i;
for (i=0,x=1,s=n; i < sizeof(long)*8; i++)
	{ if (i >=m1 && i <=m2) s |= x; x <<=1; }
return s; }
//------------------------------------------------ 6
int F6(char c[])
{ int i,s;
for (i=0; c[i] !='\0'; i++)
	if (c[i] >='0' && c[i] <='7') break;
for (s=0; c[i] >='0' && c[i] <='7'; i++)
	{ s <<=3; s |= c[i] & 0x7; }
return s; }
//------------------------------------------------ 7
void F7(char c[],long n)
{ int i=sizeof(long)*8/3 +1;
for (c[i--]='\0'; i>=0; i--)
	{ c[i] = (n & 0x7) + '0'; n >>=3; }}
//------------------------------------------------ 8
// Îïåğàöèÿ "^" - ÈÑÊËŞ×ÀŞÙÅÅ ÈËÈ
int	F8(long n)
{ int 	i,m,k;
for (i=m=k=0; i < sizeof(long) * 8; i++, n >>= 1)
    if ((n & 1) ^ m)
	{ k++; m =!m; }
return k; }
//------------------------------------------------ 9
int	F9(long n)
{ int 	i,m,k;
for (i=m=k=0; i < sizeof(long) * 8; i++, n >>= 1)
if (n & 1) k++;
else
{ if (k > m) m=k; k=0; }
return m; }
//------------------------------------------------ 10
int F10(long v){
for (int i=0; v!=0; i++, v>>=1);
return v;}

