#include <stdio.h>
//------------------------------------------------------91-12.cpp
//------ Инкремент числа во внешней форме представления
void inc(char s[]){
int i,n;
for (i=0; s[i]!=0; i++);				// Поиск конца строки
for (n=i-1; n>=0; n--){					// Младшая цифра - в конце
      if (s[n]=='9' )                   // 9 превращается в 0
		s[n]='0';
      else { s[n]++; return; }}     	// добавить 1 к цифре и выйти
for (s[i+1]=0; i>0; i--) s[i]='0' ; 	// Записать в строку 1000...
s[0]='1';}

void main(){
char c[10]="1399",cc[10]="9999";
inc(c); puts(c); inc(cc); puts(cc); }
